# **Movie Project Part 3**

Joe Lardie 

March 2023

# **Imports**

In [1]:
# Standard Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import gzip
import pymysql
pymysql.install_as_MySQLdb()

# Additional Imports
import os, json, math, time
import tmdbsimple as tmdb
from tqdm.notebook import tqdm_notebook
from sqlalchemy import create_engine, text
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *
from urllib.parse import quote_plus
from scipy import stats

In [2]:
FOLDER = "Data/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)

['akas.csv.gz',
 'basics.csv.gz',
 'final_tmdb_data_2000 (1).csv.gz',
 'final_tmdb_data_2000 (2).csv.gz',
 'final_tmdb_data_2000 (3).csv.gz',
 'final_tmdb_data_2000.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'final_tmdb_data_2002.csv.gz',
 'final_tmdb_data_2003.csv.gz',
 'final_tmdb_data_2004.csv.gz',
 'final_tmdb_data_2005.csv.gz',
 'final_tmdb_data_2006.csv.gz',
 'final_tmdb_data_2007.csv.gz',
 'final_tmdb_data_2008.csv.gz',
 'final_tmdb_data_2009.csv.gz',
 'final_tmdb_data_2010.csv.gz',
 'final_tmdb_data_2011.csv.gz',
 'final_tmdb_data_2012.csv.gz',
 'final_tmdb_data_2013.csv.gz',
 'final_tmdb_data_2014.csv.gz',
 'final_tmdb_data_2015.csv.gz',
 'final_tmdb_data_2016.csv.gz',
 'final_tmdb_data_2017.csv.gz',
 'final_tmdb_data_2018.csv.gz',
 'final_tmdb_data_2019.csv.gz',
 'final_tmdb_data_2020.csv.gz',
 'ratings.csv.gz',
 'tmdb_api_results_2000.csv.gz',
 'tmdb_api_results_2000.json',
 'tmdb_api_results_2001.json',
 'tmdb_api_results_2002.json',
 'tmdb_api_results_2003.json',
 'tmdb_api_results_2004.json',
 'tmdb_api_results_2005.json',
 'tmdb_api_results_2006.json',
 'tmdb_api_results_2007.json',
 'tmdb_api_results_2008.json',
 'tmdb_api_results_2009.json',
 'tmdb_api_results_2010.json',
 'tmdb_api_results_2011.json',
 'tmdb_api_results_2012.json',
 'tmdb_api_results_2013.json',
 'tmdb_api_results_2014.json',
 'tmdb_api_results_2015.json',
 'tmdb_api_results_2016.json',
 'tmdb_api_results_2017.json',
 'tmdb_api_results_2018.json',
 'tmdb_api_results_2019.json',
 'tmdb_api_results_2020.json',
 'tmdb_api_results_2021.json',
 'tmdb_api_results_2022.json',
 'tmdb_results_combined.csv.gz']

In [3]:
# Load in the dataframe from project part 1 as basics:
basics = pd.read_csv('Data/basics.csv.gz')

In [4]:
#Import Ratings data
ratings = pd.read_csv('Data/ratings.csv.gz')

In [5]:
#Import akas data
akas = pd.read_csv('Data/akas.csv.gz')

In [6]:
# Import Basics
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')

In [7]:
# Function to transform dataframe into SQL database format
def df_to_sql(df,primary=None):
    sql_schema = {key: None for key in df.columns}
    #Create schema to convert col.dtype to sql-types
    for col in df.columns:
       # print (f"{col} is type:{basics[col].dtype}")
        if df[col].dtype == "int64":
            sql_schema[col]=Integer()
        elif df[col].dtype == "float64":
            sql_schema[col]=Float()
        elif df[col].dtype == "object":
            sql_schema[col]=Text(df[col].fillna('').map(len).max()+1)
    if primary != None:
        #Change the primary key to type String(length=...)
        sql_schema[primary] = String(df[primary].fillna('').map(len).max()+1)
    return sql_schema

## **Creating MySQL DataBase**

In [8]:
#Create connection string using credintials
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:Root@localhost/movie"

In [9]:
# Create the engine:
engine = create_engine(connection_str)

In [10]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

In [11]:
# Check for database existance:
database_exists(connection_str)

True

In [12]:
#Check the dtypes of your dataframe: (df.dtypes).
basics.dtypes

tconst             object
titleType          object
primaryTitle       object
originalTitle      object
isAdult             int64
startYear           int64
endYear           float64
runtimeMinutes    float64
genres             object
dtype: object

In [13]:
#Use custom function to convert to sql-ready
basics_schema = df_to_sql(basics,"tconst")
basics_schema

{'tconst': String(length=11),
 'titleType': Text(length=6),
 'primaryTitle': Text(length=243),
 'originalTitle': Text(length=243),
 'isAdult': Integer(),
 'startYear': Integer(),
 'endYear': Float(),
 'runtimeMinutes': Float(),
 'genres': Text(length=30)}

In [14]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',
              index=False)

103737

In [15]:
# Obtain a connection from the engine
with engine.connect() as connection:
    # Wrap the SQL query with text
    query = text('ALTER TABLE title_basics ADD PRIMARY KEY (tconst);')
    # Execute the query
    connection.execute(query)

In [16]:
#Query the table and show first 5 rows
q = '''
SELECT *
FROM title_basics
Limit 5;
'''
pd.read_sql_query(q, engine)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,None,118.0,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,None,70.0,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,None,122.0,Drama
3,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,None,94.0,Horror
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,None,100.0,"Comedy,Horror,Sci-Fi"

In [17]:
# Printout of ratings columns
ratings.columns

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

In [18]:
# Preview of Ratings data
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2083
1  tt0000002            5.6       281
2  tt0000005            6.2      2820
3  tt0000006            5.0       194
4  tt0000007            5.4       886

In [19]:
# Ratings 'tconst' unique values
ratings['tconst'].unique()

array(['tt0000001', 'tt0000002', 'tt0000005', ..., 'tt9916348',
       'tt9916362', 'tt9916428'], dtype=object)

In [20]:
#Create a ratings_id map by pairing the unique ratings with an incrementing integer
ratings_id = range(len(ratings['tconst'].unique()))
ratings_map = dict(zip(ratings['tconst'].unique(), ratings_id))
#Add ratings_id primary key column
ratings["id"] = ratings["tconst"].map(ratings_map)

In [21]:
# Preview of ratings data
ratings.head()

      tconst  averageRating  numVotes  id
0  tt0000001            5.7      2083   0
1  tt0000002            5.6       281   1
2  tt0000005            6.2      2820   2
3  tt0000006            5.0       194   3
4  tt0000007            5.4       886   4

In [22]:
# Convert DataFrame to SQL Schema and Display
ratings_schema = df_to_sql(ratings)
ratings_schema

{'tconst': Text(length=11),
 'averageRating': Float(),
 'numVotes': Integer(),
 'id': Integer()}

In [23]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=ratings_schema,if_exists='replace',
              index=False)

543702

In [24]:
#Run the query to ADD PRIMARY KEY
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`id`);')

AttributeError: 'Engine' object has no attribute 'execute'

In [ ]:
#Query the table and show first 5 rows
q = '''
SELECT *
FROM title_ratings
Limit 5;
'''
pd.read_sql_query(q, engine)

In [ ]:
# create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

In [ ]:
# Explode the 'genres_split' Column and Display
exploded_genres = basics.explode('genres_split')
exploded_genres

In [ ]:
# Get and Sort Unique Genres from the 'genres_split' Column
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [ ]:
## Save just tconst and genres_split as new df
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

In [ ]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

In [ ]:
## Make a dictionary with list of unique genres as the key and the new iteger id as values
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

In [ ]:
# Convert 'genres_split' Column to Tuples
basics['genres_split'] = basics['genres_split'].apply(lambda x: tuple(x))

In [ ]:
## make new integer genre_id and drop string genres
basics['genre_id'] = basics['genres_split'].map(genre_map)
basics = basics.drop(columns='genres_split')

In [ ]:
## Manaully make dataframe with named cols from the .keyd and .values
genre_lookup = pd.DataFrame ({'Genre_Name': genre_id_map.keys(),
                             'genre_ID':genre_id_map.values()})
genre_lookup.head()

In [ ]:
# Add an Integer Index Column to the DataFrame
basics['int_index'] = range(len(basics))

In [ ]:
## get max string length
max_str_len = basics['genres'].fillna('').map(len).max()

In [ ]:
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [ ]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

In [ ]:
# Add a Primary Key to the 'title_basics' Table
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [ ]:
#Check the dtypes of your dataframe: (df.dtypes).
title_genres.columns

In [ ]:
#Use custom function to convert to sql-ready
title_genres_schema = df_to_sql(title_genres)
title_genres_schema

In [ ]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=title_genres_schema,if_exists='replace',
              index=False)

In [ ]:
#Query the table and show first 5 rows
q = '''
SELECT *
FROM title_genres
Limit 5;
'''
pd.read_sql_query(q, engine)

In [ ]:
# Create a DataFrame Copy of 'basics' Named 'genres'
genres = pd.DataFrame(basics)

In [ ]:
# Look at genres columns
genres.columns

In [ ]:
#Use custom function to convert to sql-ready
genres_schema = df_to_sql(genres)
genres_schema

In [ ]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=genres_schema,if_exists='replace',
              index=False)

In [ ]:
#Query the table and show first 5 rows
q = '''
SELECT *
FROM genres
Limit 5;
'''
pd.read_sql_query(q, engine)

In [ ]:
# Preview of tmdb dataframe
tmdb.head()

In [ ]:
# tmdb columns preview
tmdb.columns

In [ ]:
#Keeping only the necessary columns imdb_id, revenue, budget, and certification columns
tmdb_req = tmdb[["imdb_id","revenue","budget","certification"]]

In [ ]:
#Use custom function to convert to sql-ready
tmdb_schema = df_to_sql(tmdb_req,"imdb_id")
tmdb_schema

In [ ]:
# Save to sql with dtype and index=False
tmdb_req.to_sql('tmdb_data',engine,dtype=tmdb_schema,if_exists='replace',
              index=False)

In [ ]:
#Query the table and show first 5 rows
q = '''
SELECT *
FROM tmdb_data
Limit 5;
'''
pd.read_sql_query(q, engine)